[
  {"pregunta": "¿Qué cursos están disponibles?", "respuesta": "Actualmente puedes acceder a distintos cursos según tu área. Usa el comando /cursos para ver la lista completa de capacitaciones disponibles."},
  {"pregunta": "¿Cómo empiezo un curso?", "respuesta": "Para comenzar un curso, escribe /empezar seguido del nombre del curso. Por ejemplo: /empezar Seguridad e Higiene."},
  {"pregunta": "¿Puedo pausar un curso y seguir después?", "respuesta": "Sí, tu progreso se guarda automáticamente. Cuando regreses, podrás continuar desde el módulo donde lo dejaste."},
  {"pregunta": "¿Qué pasa si respondo mal una pregunta del quiz?", "respuesta": "No te preocupes. El bot te mostrará la respuesta correcta y una breve explicación para que puedas aprender del error."},
  {"pregunta": "¿Cuántos módulos tiene cada curso?", "respuesta": "La cantidad de módulos varía según el curso. Puedes consultarla escribiendo /info seguido del nombre del curso."},
  {"pregunta": "¿Cómo sé si terminé un curso?", "respuesta": "Al completar todos los módulos y evaluaciones, el bot te avisará que finalizaste el curso y te enviará tu certificado."},
  {"pregunta": "¿Qué tipo de certificados entregan?", "respuesta": "Los certificados son digitales en formato PDF y contienen tu nombre, el nombre del curso y la fecha de finalización."},
  {"pregunta": "¿Dónde puedo ver mis cursos completados?", "respuesta": "Puedes usar el comando /progreso para ver tus cursos activos y los que ya completaste."},
  {"pregunta": "¿Puedo repetir un curso?", "respuesta": "Sí, puedes reiniciar cualquier curso escribiendo /reiniciar seguido del nombre del curso. Esto reiniciará tu progreso en ese módulo."},
  {"pregunta": "¿Cómo accedo a los materiales del curso?", "respuesta": "Cada módulo te enviará su contenido automáticamente. Si quieres volver a verlo, puedes usar /material seguido del nombre del curso."},
  {"pregunta": "¿Puedo descargar los materiales?", "respuesta": "Sí, todos los materiales en formato PDF o video pueden descargarse directamente desde Telegram."},
  {"pregunta": "¿Puedo hacer los cursos desde el celular?", "respuesta": "Por supuesto. Todo el contenido y las evaluaciones están optimizados para dispositivos móviles."},
  {"pregunta": "¿Cómo se calculan los puntajes?", "respuesta": "Cada respuesta correcta suma puntos. Al final del curso obtendrás un puntaje total que determina si aprobaste o no."},
  {"pregunta": "¿Cuál es la nota mínima para aprobar?", "respuesta": "Debes obtener al menos el 70% de respuestas correctas en el cuestionario final para aprobar el curso."},
  {"pregunta": "¿Qué pasa si no apruebo un curso?", "respuesta": "Puedes volver a intentarlo tantas veces como quieras. El objetivo es que aprendas, no que te frustres."},
  {"pregunta": "¿Cuánto tiempo tengo para completar un curso?", "respuesta": "Cada curso tiene una duración sugerida, pero puedes hacerlo a tu propio ritmo. No hay límite de tiempo."},
  {"pregunta": "¿Quién crea los cursos?", "respuesta": "Los cursos son elaborados por profesionales del área y revisados por el equipo de capacitación interna."},
  {"pregunta": "¿Qué beneficios tengo al completar un curso?", "respuesta": "Además del certificado, ganarás puntos en el sistema de reconocimiento interno y podrás acceder a nuevos niveles de formación."},
  {"pregunta": "¿Cómo funciona el sistema de puntos?", "respuesta": "Cada módulo completado y cada curso aprobado te otorgan puntos. Al llegar a ciertos niveles, desbloqueas insignias y logros."},
  {"pregunta": "¿Puedo usar el bot fuera del horario laboral?", "respuesta": "Sí, el bot está disponible las 24 horas para que puedas capacitarte cuando te resulte más cómodo."},
  {"pregunta": "¿El bot guarda mis datos personales?", "respuesta": "Solo se guarda la información necesaria para registrar tu progreso y generar tu certificado. No compartimos tus datos con terceros."},
  {"pregunta": "¿Puedo usar el bot sin conexión a internet?", "respuesta": "No, el bot necesita conexión a internet para acceder a los materiales y guardar tu progreso."},
  {"pregunta": "¿Qué pasa si cambio de dispositivo?", "respuesta": "Tu progreso se guarda en la base de datos, por lo que puedes continuar tu curso desde cualquier dispositivo con tu cuenta de Telegram."},
  {"pregunta": "¿Cómo sé cuándo hay nuevos cursos disponibles?", "respuesta": "El bot te avisará automáticamente cuando se agreguen nuevos cursos o actualizaciones al catálogo."},
  {"pregunta": "¿Qué hago si no entiendo un tema del curso?", "respuesta": "Puedes volver a revisar el módulo o usar /ayuda para recibir recursos complementarios y aclaraciones sobre el tema."}
]
