[
    {
        "pregunta": "¿quienes somos?",
        "respuesta": "Somos Gamma Academy, tu plataforma de capacitación interna basada en IA, diseñada para reforzar el aprendizaje corporativo a través de quizzes interactivos y herramientas de IA."
    },
    {
        "pregunta": "¿como creo un quiz?",
        "respuesta": "Para crear un nuevo quiz, envía un archivo (PDF, DOCX) o un enlace de video de YouTube a un grupo donde esté el bot. Luego, responde con el nombre que deseas darle al quiz. El bot generará las preguntas automáticamente."
    },
    {
        "pregunta": "¿como empezar un quiz?",
        "respuesta": "Para iniciar un quiz en privado, utiliza el comando /empezar seguido del nombre exacto del quiz. Por ejemplo: /empezar nombre_del_quiz."
    },
    {
        "pregunta": "¿como ver los cursos disponibles?",
        "respuesta": "Usa el comando /cursos en el chat privado para ver la lista completa de todos los quizzes (cursos) disponibles actualmente en el sistema."
    },
    {
        "pregunta": "¿como exportar resultados?",
        "respuesta": "Para exportar los resultados finales de un quiz específico, utiliza el comando /exportar seguido del nombre exacto del quiz en cualquier grupo o chat privado. Por ejemplo: /exportar nombre_del_quiz."
    },
    {
        "pregunta": "¿porque no puedo exportar?",
        "respuesta": "La exportación puede fallar si no hay resultados registrados para ese quiz en el sistema, o si el nombre del quiz no coincide exactamente con el registrado."
    },
    {
        "pregunta": "¿que tipos de preguntas hay en un quiz?",
        "respuesta": "Los quizzes pueden tener tres tipos de preguntas: 'text' (opción múltiple con botones), 'voice' (debes responder con un audio), y 'photo' (debes responder con una imagen)."
    },
    {
        "pregunta": "¿la ia me evalua voz e imagen?",
        "respuesta": "Sí, las respuestas de voz y las imágenes son evaluadas automáticamente por un modelo de Inteligencia Artificial (Groq) que compara tu contenido con la respuesta esperada."
    },
    {
        "pregunta": "¿como funciona el analisis de sentimiento?",
        "respuesta": "Al finalizar cada quiz, el bot te pregunta tu opinión. El texto que envíes es procesado por un modelo BERT Multilingüe para clasificar tu feedback como 'Muy Positivo', 'Negativo', etc."
    },
    {
        "pregunta": "¿que hago si el bot se traba?",
        "respuesta": "Si el bot se queda sin responder, intenta enviar el comando /start de nuevo o vuelve a iniciar el quiz con /empezar. Si el error persiste, contacta al administrador."
    },
    {
        "pregunta": "¿puedo subir un pdf para un quiz?",
        "respuesta": "Sí, puedes subir archivos en formato PDF, DOCX, TXT, hasta videos de YouTube para que la IA genere un quiz basado en su contenido."
    }
]